; domain
;this can run in both planners
;limitation: in real mashine the special are not even distribution on conveyor 
;here assume they are even
(define (domain Recovery_2_second)

(:requirements :strips :typing)

(:types 
    WorkPiece
    Conv1 Conv2 - Point
    R1 R3 - ramp
)

(:predicates
    ;product state predicate
    (on ?WP - WorkPiece ?P - Point)
    (not_on ?WP - WorkPiece ?P - Point)
    (in ?WP - WorkPiece ?R - ramp)

    ;point feature predicates
    (next ?P0 ?P1 - Point)
    (begin ?P0 - Point)
    (end ?Pe - Point)
)

(:action LSC_moveforward
    :parameters (?WP - WorkPiece ?P1 ?P2 ?P3 ?P4 ?P5 - Conv1)
    :precondition (and 
        (begin ?P1)
        (next ?P1 ?P2)
        (next ?P2 ?P3)
        (next ?P3 ?P4)
        (next ?P4 ?P5)
        (end ?P5)
        (forall (?WP - WorkPiece)
            (not_on ?WP ?P5))
    )
    :effect (and
        (not (begin ?P1))
        (begin ?P5)
        (not (end ?P5))
        (end ?P4)
    )
)

(:action LSC_movebackward
    :parameters (?WP - WorkPiece ?P1 ?P2 ?P5 - Conv1)
    :precondition (and 
        (begin ?P1)
        (next ?P1 ?P2)
        (end ?P5)
        (forall (?WP - WorkPiece)
            (not_on ?WP ?P1))
    )
    :effect (and
        (not (begin ?P1))
        (begin ?P2)
        (not (end ?P5))
        (end ?P1)
    )
)

(:action LSC_to_PAC
    :parameters (?WP - WorkPiece ?P1 ?P2 ?P3 ?P4 ?P5 - Conv1 ?PA ?PB - Conv2)
    :precondition (and 
        (begin ?P1)
        (next ?P1 ?P2)
        (next ?P2 ?P3)
        (next ?P3 ?P4)
        (next ?P4 ?P5)
        (end ?P5)
        (begin ?PA)
        (end ?PB)
        (on ?WP ?P3)
    )
    :effect (and 
        (on ?WP ?PA)
        (not(on ?WP ?P3))
    )
)

(:action PAC_to_LSC
    :parameters (?WP - WorkPiece ?P1 ?P2 ?P3 ?P4 ?P5 - Conv1 ?PA ?PB - Conv2)
    :precondition (and 
        (begin ?P1)
        (next ?P1 ?P2)
        (next ?P2 ?P3)
        (next ?P3 ?P4)
        (next ?P4 ?P5)
        (end ?P5)
        (begin ?PA)
        (end ?PB)
        (on ?WP ?PA)
    )
    :effect (and 
        (on ?WP ?P3)
        (not(on ?WP ?PA))
    )
)

(:action push_ramp1
    :parameters (?WP - WorkPiece ?P1 - Conv1 ?R - R1)
    :precondition (and 
        (end ?P1)
        (on ?WP ?P1)
    )
    :effect (and 
        (in ?WP ?R)
    )
)

(:action push_ramp3
    :parameters (?WP - WorkPiece ?P1 ?P2 ?P3 ?P4 ?P5 - Conv1 ?R - R3)
    :precondition (and 
        (begin ?P1)
        (next ?P1 ?P2)
        (next ?P2 ?P3)
        (next ?P3 ?P4)
        (next ?P4 ?P5)
        (end ?P5)
        (on ?WP ?P2)
    )
    :effect (and 
        (in ?WP ?R)
    )
)

(:action PAC_moveforward
    :parameters (?WP - WorkPiece ?P1 ?P2 - Conv2)
    :precondition (and 
        (begin ?P1)
        (end ?P2)
        (forall (?WP - WorkPiece)
            (not_on ?WP ?P2))
    )
    :effect (and
        (not (begin ?P1))
        (begin ?P2)
        (not (end ?P2))
        (end ?P1)
    )
)

(:action PAC_movebackward
    :parameters (?WP - WorkPiece ?P1 ?P2 - Conv2)
    :precondition (and 
        (begin ?P1)
        (end ?P2)
        (forall (?WP - WorkPiece)
            (not_on ?WP ?P1))
    )
    :effect (and
        (not (begin ?P1))
        (begin ?P2)
        (not (end ?P2))
        (end ?P1)
    )
)

)

; problem
(define (problem Recovery_2_second_prob) (:domain Recovery_2_second)
(:objects 
    WP1 WP2 - WorkPiece
    PA1 PA2 PA3 PA4 PA5 - Conv1
    PB1 PB2 - Conv2
    R1 - R1
    R3 - R3
)

(:init
    ; Product initial state
    (on WP1 PA1)
    (not_on WP1 PA2)
    (not_on WP1 PA3)
    (not_on WP1 PA4)
    (not_on WP1 PA5)
    (not_on WP1 PB1)
    (not_on WP1 PB2)

    (on WP2 PB2)
    (not_on WP2 PA1)
    (not_on WP2 PA2)
    (not_on WP2 PA3)
    (not_on WP2 PA4)
    (not_on WP2 PA5)
    (not_on WP2 PB1)

    ; points features
    (next PA1 PA2)
    (next PA2 PA3)
    (next PA3 PA4)
    (next PA4 PA5)
    (next PA5 PA1)
    (begin PA1)
    (end PA5)

    (begin PB1)
    (end PB2)
)

(:goal (and
    (in WP1 R1)
    (in WP2 R3)
))

)

; plan
1. (pac_movebackward wp1 pb1 pb2)
   deleted: (begin pb1) (end pb2)
   added: (begin pb2) (end pb1)
   goals met: 0 of 2
2. (lsc_moveforward wp1 pa1 pa2 pa3 pa4 pa5)
   deleted: (begin pa1) (end pa5)
   added: (begin pa5) (end pa4)
   goals met: 0 of 2
3. (pac_to_lsc wp2 pa5 pa1 pa2 pa3 pa4 pb2 pb1)
   deleted: (on wp2 pb2)
   added: (on wp2 pa2)
   goals met: 0 of 2
4. (lsc_movebackward wp1 pa5 pa1 pa4)
   deleted: (begin pa5) (end pa4)
   added: (begin pa1) (end pa5)
   goals met: 0 of 2
5. (push_ramp3 wp2 pa1 pa2 pa3 pa4 pa5 r3)
   added: (in wp2 r3)
   goals met: 1 of 2
6. (lsc_moveforward wp1 pa1 pa2 pa3 pa4 pa5)
   deleted: (begin pa1) (end pa5)
   added: (begin pa5) (end pa4)
   goals met: 1 of 2
7. (lsc_moveforward wp1 pa5 pa1 pa2 pa3 pa4)
   deleted: (begin pa5) (end pa4)
   added: (begin pa4) (end pa3)
   goals met: 1 of 2
8. (lsc_moveforward wp1 pa4 pa5 pa1 pa2 pa3)
   deleted: (begin pa4) (end pa3)
   added: (begin pa3) (end pa2)
   goals met: 1 of 2
9. (lsc_moveforward wp1 pa3 pa4 pa5 pa1 pa2)
   deleted: (begin pa3) (end pa2)
   added: (begin pa2) (end pa1)
   goals met: 1 of 2
10. (push_ramp1 wp1 pa1 r1)
   added: (in wp1 r1)
   goals met: 2 of 2
